YUJJHH/Microcomputer_STM32F4IG_3.1-3.2/3_PR1_2019130027_유정환.c
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Term Project 1: Tracking a Car(자동차 추종시스템)
// 제출자: 2019130027 유정환
// 제출일:2023-12-14
// 동작개요:  전기자동차 2대가 길을 따라 운행하고, 선도차(Lead car)는 random하게 운행하고 추종차(Following car)는 선도차와의 거리와
// 인도와의 거리를 계속 측정하면서 속도와 방향을 조정하며 선도차를 따라가는 동작
// 주요 내용 및 구현 방법
// 거리센서 종류:  ADC3_CH1 (PA1) : 키트가변저항,   ADC3_CH9 (PF3) : 외부 가변저항
// 추종차 엔진: TIM4_CH2(PB7) : 외부 LED로 PWM 변화 확인 
// 추종차 핸들: TIM14_CH1(PF9) : 부저로 PWM 변화 확인
// EXTI12 (SW4) : MOVE-key , EXTI14 (SW6) : STOP-key
// PC 통신 : MOVE-key('M') , STOP-key('S')
// Memory: ADC_value[2]; [0] 키트가변저항, [1] 외부 가변저항 
// ADC설정: ADC3, SCAN mode,  2 ch 변환, DMA mode, 10 bit RES, 
// DMA 설정: DMA2 Stream0 channel 2(ADC3), Peripheral-to-memory (P=>M), DMA_BufferSize = 2 (ADC_Value[2])
//               Circular mode, Priority level - High, FIFO_direct mode, 
//               Peripheral address pointer is fixed, Memory address pointer is incremented after each data transferd 
// USART1: TX pin: PA9, RX pin: PA10 
// TX: Polling 방식, RX: Interrupt 방식
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#include "FRAM.h"
#include "stm32f4xx.h"
#include "GLCD.h"

#define SW0_PUSH        0xFE00  //PH8
#define SW1_PUSH        0xFD00  //PH9
#define SW2_PUSH        0xFB00  //PH10
#define SW3_PUSH        0xF700  //PH11
#define SW4_PUSH        0xEF00  //PH12
#define SW5_PUSH        0xDF00  //PH13
#define SW6_PUSH        0xBF00  //PH14
#define SW7_PUSH        0x7F00  //PH15

void _GPIO_Init(void);
uint16_t KEY_Scan(void);
void USART1_Init(void);
void USART_BRR_Configuration(uint32_t USART_BaudRate);

void _EXTI_Init(void);

void SerialSendChar(uint8_t c);
void SerialSendString(char *s);

void RunMenu(void);
void _ADC_Init(void);
void DMAInit(void);

void DelayMS(unsigned short wMS);
void DelayUS(unsigned short wUS);

uint16_t ADC_value[2];

char str1[20];          //거리센서1 측정 문자열
char str2[20];          //거리센서2 측정 문자열


void TIMER1_OC_Init(void);            // Timer 1 (Output Compare mode)


  int16_t x=0, y=1;      //막대그래프를 나타내기 위한 변수

 void TIMER14_PWM_Init(void);  // 추종차 방향 제어, 주기 400us
void TIMER4_PWM_Init(void);  // 추종차 속도 제어, 주기 5s
  
uint16_t MOVE_FLAG=0; //MOVE 상태 플래그



int main(void)
{

         

        _EXTI_Init();

        USART1_Init();
	_ADC_Init();          
        
        
	DMAInit();
        _GPIO_Init();
        
	LCD_Init();		// LCD 구동 함수
	DelayMS(500);		// LCD구동 딜레이
          
	
	RunMenu();
        TIMER1_OC_Init();      // Timer 1 (Output Compare mode)  , 400ms마다 AD 변환
	
       TIMER14_PWM_Init();  // 추종차 방향 제어, 주기 400us
       TIMER4_PWM_Init();    //추종차 속도제어 , 주기 5초
       
      
         
        Fram_Init();                    // FRAM 초기화 H/W 초기화
	Fram_Status_Config();   // FRAM 초기화 S/W 초기화
 
     
        //FRAM 저장값 리드
        
        MOVE_FLAG=Fram_Read(1201);  
      
        LCD_SetBackColor(RGB_WHITE);	//글자배경색 
        LCD_SetFont(&Gulim7);
        LCD_SetTextColor(RGB_BLUE);     //글자색 
        
        if(MOVE_FLAG==0)  //STOP 상태
        {
            MOVE_FLAG=0;        //MOVE 동작 x      
                
            LCD_DisplayText(1,24," S");  //STOP 표시
            LCD_DisplayText(2,24," 0"); //D1 거리 0
            LCD_DisplayText(3,24," 1"); // D2 거리 1
                       
            TIM4->CCR2=0;  //엔진 PWM  DR=0%
            TIM14->CCR1=0;  //핸들 PWM  DR=0%
                      
            //D1 막대 지움
            LCD_SetBrushColor(RGB_WHITE);     //브러시색 흰색
            LCD_DrawFillRect(21,23,6*(19),9);    
            
            x=0;   //D1막대 0
            y=1;  // D2막대 1 표시
        
            LCD_SetBrushColor(RGB_WHITE);     //브러시색 흰색
            LCD_DrawFillRect(21+38*y,34,38*(3-y),9);    
            
            LCD_SetBrushColor(RGB_GREEN);        //브러시색  초록   
            LCD_DrawFillRect(21,34,38*y,9);   
             
            LCD_DisplayText(4,7,"00");  //엔진 PWM DR=0%
            LCD_DisplayText(4,21,"F");  // 핸들 직진 F
                   
        
        }
        
        else if(MOVE_FLAG==1)  // MOVE 상태
        {
             MOVE_FLAG=1;   //MOVE 동작
             LCD_DisplayText(1,24," M");  //MOVE 표시
        }
  
       
       
       
 	while(1)
	{
          LCD_SetTextColor(RGB_BLACK);     //글자색 검정
          LCD_DisplayText(3,0,"D2:");
          LCD_DisplayText(4,0,"SP(DR):");
          LCD_DisplayText(4,9,"%   DIR(DR):");     
          LCD_DisplayText(4,22,"    ");
         
             if(MOVE_FLAG==1)   //MOVE 상태이면
             {       
                    
                   LCD_SetTextColor(RGB_BLUE);     //글자색   
             
                      if(y==0)                   //명령값 = 0 이면   (핸들 오른쪽 )
                      {
                          TIM14->CCR1 = 8*3;		// DR=30%
                          LCD_DisplayText(4,21,"R");
                      }
                      else if(y==1)             //명령값 = 1 이면      (핸들 직진 )
                      {
                          TIM14->CCR1 = 0;		// DR=0%
                           LCD_DisplayText(4,21,"F");
                      }
                      else if(y==2 || y==3)             //명령값 = 2~3 이면     (핸들 왼쪽 )
                      {
                          TIM14->CCR1 = 8*9;		// DR=90%
                           LCD_DisplayText(4,21,"L");
                      }
                      
                      
                      
                      if(x==3 || x==4)                   //측정거리 3~4m이면   
                      {
                          TIM4->CCR2 = 5000*1;		// DR=10%
                          LCD_DisplayText(4,7,"10");
                      }
                      else if(x==5 || x==6)               //측정거리 5~6m이면   
                      {
                           TIM4->CCR2 = 5000*2;		// DR=20%
                           LCD_DisplayText(4,7,"20");
                      }
                      else if(x==7 || x==8)             //측정거리 7~8m이면   
                      {
                           TIM4->CCR2 = 5000*3;		// DR=30%
                           LCD_DisplayText(4,7,"30");
                      }
                      else if(x==9 || x==10)              //측정거리 9~10m이면   
                      {
                           TIM4->CCR2 = 5000*4;		// DR=40%
                           LCD_DisplayText(4,7,"40");
                      }
                     else if(x==11 || x==12)              //측정거리 11~12m이면   
                      {
                           TIM4->CCR2 = 5000*5;		// DR=50%
                           LCD_DisplayText(4,7,"50");
                      }
                      else if(x==13 || x==14)              //측정거리 13~14m이면   
                      {
                           TIM4->CCR2 = 5000*6;		// DR=60%
                           LCD_DisplayText(4,7,"60");
                      }
                      else if(x==15 || x==16)             //측정거리 15~16m이면   
                      {
                           TIM4->CCR2 = 5000*7;		// DR=70%
                           LCD_DisplayText(4,7,"70");
                      }
                      else if(x==17 || x==18)             //측정거리 17~18m이면   
                      {
                          TIM4->CCR2 = 5000*8;		// DR=80%
                          LCD_DisplayText(4,7,"80");
                      }
                      else if(x==19)                       //측정거리 19m이면   
                      {
                           TIM4->CCR2 = 5000*9;		// DR=90%
                           LCD_DisplayText(4,7,"90");
                      }
                       else if(x==0)                       //측정거리 0m이면   
                      {
                          		
                           LCD_DisplayText(4,7,"00");
                      }


