YUJJHH/Microcomputer_STM32F4IG_3.1-3.2/3_PR1_2019130027_유정환.c
void USART1_IRQHandler(void)	
{       
	if ( (USART1->SR & USART_SR_RXNE) ) // USART_SR_RXNE= 1? RX Buffer Full?
	// #define  USART_SR_RXNE ((uint16_t)0x0020)    //  Read Data Register Not Empty     
	{
		char ch;
            
		
                ch = (uint16_t)(USART1->DR & (uint16_t)0x01FF);	// 수신된 문자 저장
                //SerialSendChar(ch); 		// PC에 수신된 문자를 Echo
       
                LCD_SetFont(&Gulim7);
                LCD_SetBackColor(RGB_WHITE);	//글자배경색      
                LCD_SetTextColor(RGB_BLACK);     //글자색 
                LCD_DisplayText(4,0,"SP(DR):");
                LCD_DisplayText(4,9,"%   DIR(DR):     ");
                LCD_SetTextColor(RGB_BLUE);     //글자색 
                
                if(ch=='M')  //M을 수신 받으면
                {   
                      
                    MOVE_FLAG=1;   //MOVE 동작
                    LCD_DisplayText(1,24," M");  //MOVE 표시
                     
                    Fram_Write(1201,MOVE_FLAG);         //MOVE 상태 저장
                    
                }
                if(ch=='S')  //S를 수신 받으면
                {
                    MOVE_FLAG=0;        //MOVE 동작 x      
                        
                    LCD_DisplayText(1,24," S");  //STOP 표시
                    LCD_DisplayText(2,24," 0"); //D1 거리 0
                    LCD_DisplayText(3,24," 1"); // D2 거리 1
                               
                              
                    TIM4->CCR2=0;  //엔진 PWM  DR=0%
                    TIM14->CCR1=0;  //핸들 PWM  DR=0%
                              
                    //D1 막대 지움
                    LCD_SetBrushColor(RGB_WHITE);     //브러시색 흰색
                    LCD_DrawFillRect(21,23,6*(19),9);    
                    
                    x=0;   //D1막대 0
                    y=1;  // D2막대 1 표시
                    LCD_SetBrushColor(RGB_WHITE);     //막대 지우고 생성
                    LCD_DrawFillRect(21+38*y,34,38*(3-y),9);    
                     
                    LCD_SetBrushColor(RGB_GREEN);           
                    LCD_DrawFillRect(21,34,38*y,9);   
                     
                    LCD_DisplayText(4,7,"00");  //엔진 PWM DR=0%
                    LCD_DisplayText(4,21,"F");  // 핸들 직진, F
                           
                    Fram_Write(1201,MOVE_FLAG);         //STOP 상태 저장 
                }    
                 
	} 
	// DR 을 읽으면 SR.RXNE bit(flag bit)는 clear 된다. 즉 clear 할 필요없음 
}


void EXTI15_10_IRQHandler(void)		
{
	LCD_SetTextColor(RGB_BLACK);     //글자색 검정
        LCD_DisplayText(3,0,"D2:");
        LCD_DisplayText(4,0,"SP(DR):");
        LCD_DisplayText(4,9,"%   DIR(DR):");;      
               
             
        if(EXTI->PR & (1<<12))                   // EXTI12 Interrupt Pending(발생) 여부?  
	{
                  EXTI->PR |= (1<<12);       // Pending bit Clear      
                  MOVE_FLAG=1;   //MOVE 동작
                  
                  LCD_SetTextColor(RGB_BLUE);     //글자색 
                  LCD_DisplayText(1,24," M");  //MOVE 표시
                   
                 Fram_Write(1201,MOVE_FLAG);         //MOVE 상태 저장
                 
             
	}
       
        if(EXTI->PR & (1<<14))                   // EXTI14 Interrupt Pending(발생) 여부?  
	{
                EXTI->PR |= (1<<14);       // Pending bit Clear    	
                MOVE_FLAG=0;        //stop 동작      
                
                 LCD_SetTextColor(RGB_BLUE);     //글자색         
                 LCD_DisplayText(1,24," S");  //STOP 표시
                 LCD_DisplayText(2,24," 0"); //D1 거리 0
                 LCD_DisplayText(3,24," 1"); // D2 거리 1
                               
                              
                 TIM4->CCR2=0;  //엔진 PWM  DR=0%
                 TIM14->CCR1=0;  //핸들 PWM  DR=0%
                              
                 //D1 막대 지움
                 LCD_SetBrushColor(RGB_WHITE);     //브러시색 흰색
                 LCD_DrawFillRect(21,23,6*(19),9);    
                  
                 x=0;  //D1막대 0표시
                 y=1;  // D2막대 1 표시
                 LCD_SetBrushColor(RGB_WHITE);     //막대 지우고 생성
                 LCD_DrawFillRect(21+38*y,34,38*(3-y),9);    
                     
                 LCD_SetBrushColor(RGB_GREEN);           
                 LCD_DrawFillRect(21,34,38*y,9);   
                     
                  LCD_SetTextColor(RGB_BLUE);     //글자색   
                
                 LCD_DisplayText(4,7,"00");  //엔진 PWM DR=0%
                 LCD_DisplayText(4,21,"F");  // 핸들 직진, F
                           
                 Fram_Write(1201,MOVE_FLAG);         //STOP 상태 저장 
        
           
	}
}
   


void _EXTI_Init(void)  
{
	RCC->AHB1ENR 	|= 0x00000080;	// RCC_AHB1ENR GPIOH Enable
	RCC->APB2ENR 	|= 0x00004000;	// Enable System Configuration Controller Clock
			// 0b 0000 0000 0000 0000 0100 0000 0000 0000
	GPIOH->MODER 	&= ~0xFFFF0000;	// GPIOH PIN8~PIN15 Input mode (reset state)				 
	
	SYSCFG->EXTICR[3] |= 0x0007;	// EXTI12에 대한 소스 입력은 GPIOH로 설정
        SYSCFG->EXTICR[3] |= 0x0700; 	// EXTI14에 대한 소스 입력은 GPIOH로 설정

	EXTI->FTSR |= (1<<12);	// EXTI12: Falling Trigger Enable 
	EXTI->IMR   |=  (1<<12);	// EXTI12 인터럽트 mask (Interrupt Enable) 설정

        EXTI->FTSR |= (1<<14);	// EXTI14: Falling Trigger Enable 
	EXTI->IMR   |=  (1<<14);	// EXTI14 인터럽트 mask (Interrupt Enable) 설정

	NVIC->ISER[1] |= (1<< (40-32));	// Enable 'Global Interrupt EXTI12,14'
}

void SerialSendChar(uint8_t Ch) // 1문자 보내기 함수
{
	// USART_SR_TXE(1<<7)=0?, TX Buffer NOT Empty? 
	// TX buffer Empty되지 않으면 계속 대기(송신 가능한 상태까지 대기)
        while((USART1->SR & USART_SR_TXE) == RESET); 
	USART1->DR = (Ch & 0x01FF);	// 전송 (최대 9bit 이므로 0x01FF과 masking)
}

void SerialSendString(char *str) // 여러문자 보내기 함수
{
	while (*str != '\0') // 종결문자가 나오기 전까지 구동, 종결문자가 나온후에도 구동시 메모리 오류 발생가능성 있음.
	{
		SerialSendChar(*str);	// 포인터가 가르키는 곳의 데이터를 송신
		str++; 			// 포인터 수치 증가
	}
}

// Baud rate 설정
void USART_BRR_Configuration(uint32_t USART_BaudRate)
{ 
	uint32_t tmpreg = 0x00;
	uint32_t APB2clock = 84000000;	//PCLK2_Frequency
	uint32_t integerdivider = 0x00;
	uint32_t fractionaldivider = 0x00;

	// Find the integer part 
	if ((USART1->CR1 & USART_CR1_OVER8) != 0) // USART_CR1_OVER8=(1<<15)
	//  #define  USART_CR1_OVER8 ((uint16_t)0x8000) // USART Oversampling by 8 enable   
	{       // USART1->CR1.OVER8 = 1 (8 oversampling)
		// Computing 'Integer part' when the oversampling mode is 8 Samples 
		integerdivider = ((25 * APB2clock) / (2 * USART_BaudRate));  // 공식에 100을 곱한 곳임(소수점 두번째자리까지 유지하기 위함)  
	}
	else  // USART1->CR1.OVER8 = 0 (16 oversampling)
	{	// Computing 'Integer part' when the oversampling mode is 16 Samples 
		integerdivider = ((25 * APB2clock) / (4 * USART_BaudRate));  // 공식에 100을 곱한 곳임(소수점 두번째자리까지 유지하기 위함)    
	}								     // 100*(f_CK) / (8*2*Buadrate) = (25*f_CK)/(4*Buadrate)	
	tmpreg = (integerdivider / 100) << 4;
  
